Repository: christhoval06/cosecha_app
Catalog: lib/l10n/app_*.arb
Languages: es

# backButton
source: Back
es: Volver

# invalidProductMessage
source: The product is invalid.
es: El producto no es válido.

# homeTitle
source: Home
es: Inicio

# counterMessage
source: You have pushed the button this many times:
es: Has presionado el botón esta cantidad de veces:

# counterIncrementTooltip
source: Increment
es: Incrementar

# onboardingSlide1Title
source: Record your sales
es: Registra tus ventas

# onboardingSlide1Description
source: Quickly and easily record every sale. All your information is securely stored on your device.
es: Anota cada venta de forma rápida y sencilla. Toda tu información queda guardada de forma segura en tu dispositivo.

# onboardingSlide2Title
source: Organize your business
es: Organiza tu negocio

# onboardingSlide2Description
source: Manage products, prices, and transactions in one place. Stay in control without complicated processes.
es: Gestiona productos, precios y movimientos en un solo lugar. Mantén el control sin procesos complicados.

# onboardingSlide3Title
source: Understand your results
es: Entiende tus resultados

# onboardingSlide3Description
source: Customize your home with widgets and presets to focus only on what matters.
es: Personaliza tu inicio con widgets y plantillas para ver solo lo importante de tu negocio.

# onboardingSlide4Title
source: Analyze with reports
es: Analiza con reportes

# onboardingSlide4Description
source: Filter by channel, product, amount, and quantity to spot changes and opportunities quickly.
es: Filtra por canal, producto, monto y cantidad para detectar cambios y oportunidades rapidamente.

# onboardingSlide5Title
source: Export to Excel
es: Exporta a Excel

# onboardingSlide5Description
source: Configure models and fields to export. By default, you can export everything in one tap.
es: Configura modelos y campos a exportar. Por defecto puedes exportar todo con un solo toque.

# onboardingSkip
source: Skip
es: Omitir

# onboardingNext
source: Next
es: Siguiente

# onboardingStart
source: Get started
es: Comenzar

# businessProfileTitle
source: Business profile
es: Perfil del negocio

# businessNameLabel
source: Name
es: Nombre

# businessImageUrlLabel
source: Image
es: Imagen

# businessCurrencyLabel
source: Currency
es: Moneda

# businessCurrencyOtherLabel
source: Other currency
es: Otra moneda

# businessCurrencySymbolLabel
source: Symbol (optional)
es: Símbolo (opcional)

# currencyNameUsd
source: US Dollar
es: Dólar estadounidense

# currencyNamePen
source: Peruvian sol
es: Sol peruano

# currencyNameMxn
source: Mexican peso
es: Peso mexicano

# currencyNameCop
source: Colombian peso
es: Peso colombiano

# businessSave
source: Save
es: Guardar

# imagePickerCamera
source: Take photo
es: Tomar foto

# imagePickerGallery
source: Choose from gallery
es: Elegir de galería

# imagePickerRemove
source: Remove
es: Quitar

# profileSetupTitle
source: Set up your business
es: Configura tu Negocio

# profileEditTitle
source: Edit business
es: Editar negocio

# profileSetupNameLabel
source: Business name
es: Nombre del negocio

# profileSetupNameRequired
source: Name is required.
es: El nombre es obligatorio.

# profileSetupNameMin
source: Must be at least {min} characters.
es: Debe tener al menos {min} caracteres.

# profileSetupLogoRequired
source: Logo is required.
es: El logo es obligatorio.

# profileSetupCurrencyLabel
source: Currency
es: Moneda

# profileSetupCurrencyHint
source: Select your currency
es: Selecciona tu moneda

# profileSetupCurrencyOtherOption
source: Other (custom)...
es: Otra (personalizada)...

# profileSetupCurrencyRequired
source: You must select a currency.
es: Debes seleccionar una moneda.

# profileSetupCustomSymbolLabel
source: Currency symbol (e.g. $)
es: Símbolo de la moneda (ej: S/)

# profileSetupCustomSymbolRequired
source: Symbol is required.
es: El símbolo es obligatorio.

# profileSetupCustomCodeLabel
source: Currency code (e.g. USD)
es: Código de la moneda (ej: PEN)

# profileSetupCustomCodeRequired
source: Code is required.
es: El código es obligatorio.

# profileSetupSaveContinue
source: Save and continue
es: Guardar y continuar

# profileSave
source: Save
es: Guardar

# profileSetupSaveError
source: Failed to save profile
es: Error al guardar el perfil

# productsTitle
source: Products
es: Productos

# productEditTitle
source: Edit product
es: Editar producto

# productAddTitle
source: Add product
es: Agregar producto

# productActionSave
source: Save
es: Guardar

# productActionCreate
source: Create
es: Crear

# productImageLabel
source: Product image
es: Imagen del producto

# productNameLabel
source: Product name
es: Nombre del producto

# productNameHint
source: Organic watermelon (premium)
es: Sandía orgánica (premium)

# productNameRequired
source: Name is required.
es: El nombre es obligatorio.

# productNameMin
source: Must be at least {min} characters.
es: Debe tener al menos {min} caracteres.

# productDescriptionLabel
source: Description
es: Descripción

# productDescriptionHint
source: Fresh harvest, 2–3 kg per unit. Packed for local delivery.
es: Cosecha fresca, 2–3 kg por unidad. Empaque para entrega local.

# productPriceLabel
source: Base price
es: Precio base

# productPriceRequired
source: Price is required.
es: El precio es obligatorio.

# productPriceInvalid
source: Enter a valid price.
es: Ingresa un precio válido.

# productUpdatePrice
source: Update price
es: Actualizar precio

# productPricePerformanceTitle
source: Price performance
es: Rendimiento del precio

# productPricePerformanceChart
source: Chart ({range})
es: Gráfico ({range})

# productAddButton
source: Add product
es: Agregar producto

# productSaving
source: Saving...
es: Guardando...

# productSaveError
source: Failed to save product
es: Error al guardar el producto

# productsEmptyTitle
source: No products yet
es: Aún no tienes productos

# productsEmptyDescription
source: Add your first product to start tracking sales and prices.
es: Agrega tu primer producto para comenzar a registrar ventas y precios.

# productsEmptyAction
source: Add product
es: Agregar producto

# productsSearchHint
source: Search products...
es: Buscar producto...

# homePerformanceOverview
source: PERFORMANCE OVERVIEW
es: RESUMEN DE RENDIMIENTO

# homeToday
source: Today
es: Hoy

# homeThisWeek
source: This week
es: Esta semana

# homeThisMonth
source: This month
es: Este mes

# homeQuickSale
source: QUICK SALE
es: VENTA RÁPIDA

# homeAddSale
source: Add sale
es: Agregar venta

# homeRecentSales
source: Recent product sales
es: Ventas recientes

# homeCustomizeTitle
source: Customize home widgets
es: Personalizar widgets de inicio

# homeCustomizePresetsTitle
source: Presets
es: Plantillas

# homePresetBasic
source: Basic
es: Basico

# homePresetCommercial
source: Commercial
es: Comercial

# homePresetAnalytical
source: Analytical
es: Analitico

# homeWidgetSalesGoal
source: Sales goal
es: Meta de ventas

# homeWidgetQuickActions
source: Quick actions
es: Acciones rapidas

# homeWidgetChannelMix
source: Channel mix
es: Mix por canal

# homeWidgetAvgTicketTrend
source: Avg. ticket trend
es: Tendencia de ticket promedio

# homeWidgetProductsAtRisk
source: Products at risk
es: Productos en riesgo

# homeWidgetWeeklyActivity
source: Weekly activity
es: Actividad semanal

# homeWidgetWeeklyInsights
source: Weekly insights
es: Insights semanales

# homeQuickActionsTitle
source: Quick actions
es: Acciones rapidas

# homeQuickActionsSubtitle
source: Shortcuts for frequent tasks
es: Atajos para tareas frecuentes

# homeActionNewSale
source: New sale
es: Nueva venta

# homeActionSalesHistory
source: History
es: Historial

# homeActionReports
source: Reports
es: Reportes

# homeActionBackup
source: Backup
es: Respaldo

# homeActionViewProducts
source: View products
es: Ver productos

# homeSalesGoalTitle
source: Monthly goal progress
es: Avance de meta mensual

# homeSalesGoalSubtitle
source: Current month vs estimated goal
es: Mes actual vs meta estimada

# homeSalesGoalOf
source: of {goal}
es: de {goal}

# homeNoSalesData
source: No sales data available.
es: No hay datos de ventas disponibles.

# homeChannelMixTitle
source: Channel mix
es: Mix por canal

# homeChannelMixSubtitle
source: Sales split in the last 30 days
es: Distribucion de ventas en los ultimos 30 dias

# homeAvgTicketTitle
source: Average ticket
es: Ticket promedio

# homeAvgTicketSubtitle
source: Last 7 days vs previous 7 days
es: Ultimos 7 dias vs 7 dias previos

# homeAvgTicketTransactions
source: {count} transactions in the period
es: {count} transacciones en el periodo

# homeWeeklyActivityTitle
source: Weekly activity
es: Actividad semanal

# homeWeeklyActivitySubtitle
source: Transactions by day (last 7 days)
es: Transacciones por dia (ultimos 7 dias)

# homeProductsAtRiskTitle
source: Products at risk
es: Productos en riesgo

# homeProductsAtRiskSubtitle
source: No sales in the last 21 days
es: Sin ventas en los ultimos 21 dias

# homeProductsAtRiskEmpty
source: No products at risk right now.
es: No hay productos en riesgo actualmente.

# homeProductsAtRiskNoSales
source: No recorded sales
es: Sin ventas registradas

# homeProductsAtRiskDaysNoSales
source: {days} days without sales
es: {days} dias sin ventas

# homeWeeklyInsightsTitle
source: Weekly insights
es: Insights semanales

# homeWeeklyInsightsSubtitle
source: Automatic summary of the last 7 days
es: Resumen automatico de los ultimos 7 dias

# homeInsightDirectionUp
source: Up
es: Suben

# homeInsightDirectionDown
source: Down
es: Bajan

# homeInsightRevenueDelta
source: {direction} sales {percent} ({amount}) vs previous week
es: {direction} ventas {percent} ({amount}) vs semana previa

# homeInsightChannelShift
source: {channel} channel gains share ({percent})
es: Canal {channel} gana participacion ({percent})

# homeInsightTopProduct
source: Top product: {product}
es: Top producto: {product}

# homeInsightNoSignificantChange
source: No significant changes this week.
es: Sin cambios relevantes esta semana.

# homeSeeHistory
source: See history
es: Ver historial

# homeHoursAgo
source: {hours} HOURS AGO
es: HACE {hours} HORAS

# homeYesterday
source: YESTERDAY
es: AYER

# navSales
source: Sales
es: Ventas

# navReports
source: Reports
es: Reportes

# navProducts
source: Products
es: Productos

# navSettings
source: Settings
es: Ajustes

# comingSoonTitle
source: Coming soon
es: Muy pronto

# comingSoonMessage
source: We are working on this section.
es: Estamos trabajando en esta sección.

# comingSoonError
source: Invalid section
es: Sección inválida

# salesHistoryTitle
source: Sales history
es: Historial de ventas

# salesRange1W
source: 1W
es: 1S

# salesEmptyTitle
source: No sales yet
es: Aún no hay ventas

# salesEmptyDescription
source: Add your first sale to see the history.
es: Agrega tu primera venta para ver el historial.

# salesEmptyAction
source: Add sale
es: Agregar venta

# salesToday
source: TODAY
es: HOY

# salesYesterday
source: YESTERDAY
es: AYER

# salesAddTitle
source: Add sale
es: Agregar venta

# salesProductImage
source: Product image
es: Imagen del producto

# salesProductName
source: Product
es: Producto

# salesProductNameRequired
source: Product is required.
es: El producto es obligatorio.

# salesQuantity
source: Quantity
es: Cantidad

# salesQuantityRequired
source: Quantity is required.
es: La cantidad es obligatoria.

# salesAmount
source: Amount
es: Monto

# salesAmountRequired
source: Amount is required.
es: El monto es obligatorio.

# salesChannel
source: Channel
es: Canal

# salesChannelRequired
source: Select a channel.
es: Selecciona un canal.

# salesChannelRetail
source: Retail
es: Minorista

# salesChannelWholesale
source: Wholesale
es: Mayorista

# salesFiltersAll
source: All
es: Todos

# salesFiltersSort
source: Sort
es: Orden

# salesSortLatest
source: Most recent
es: Más recientes

# salesSortHighestAmount
source: Highest amount
es: Mayor monto

# salesSortHighestQuantity
source: Highest quantity
es: Mayor cantidad

# salesFiltersClear
source: Clear
es: Limpiar

# salesFiltersApply
source: Apply
es: Aplicar

# salesSave
source: Save sale
es: Guardar venta

# salesSaving
source: Saving...
es: Guardando...

# salesSaveError
source: Failed to save sale
es: Error al guardar la venta

# homeRecentEmpty
source: No recent sales yet.
es: Aún no hay ventas recientes.

# homeQuickAddProducts
source: Add products
es: Agregar productos

# salesProductSelect
source: Select a product
es: Selecciona un producto

# salesSearchHint
source: Search products...
es: Buscar productos...

# salesChangeProduct
source: Change
es: Cambiar

# settingsTitle
source: Settings
es: Ajustes

# settingsAppTagline
source: Sales and product control
es: Control de ventas y productos

# settingsBusinessTitle
source: Business
es: Negocio

# settingsBusinessSubtitle
source: Update business details
es: Actualizar datos del negocio

# settingsBackupTitle
source: Data & Backup
es: Datos y Respaldo

# settingsBackupSubtitle
source: Backups and Export Excel
es: Copias de seguridad y Exportar Excel

# dataBackupTitle
source: Data & Backup
es: Datos y Respaldo

# dataBackupSummaryTitle
source: Summary
es: Resumen

# dataBackupProducts
source: Products
es: Productos

# dataBackupSales
source: Sales
es: Ventas

# dataBackupPriceHistory
source: Price history
es: Historial de precios

# dataBackupActionsTitle
source: Actions
es: Acciones

# dataBackupExportExcel
source: Export to Excel
es: Exportar a Excel

# dataBackupExportConfig
source: Configure Excel export
es: Configurar exportacion Excel

# dataBackupExportEncrypted
source: Export encrypted backup
es: Exportar respaldo encriptado

# dataBackupRestore
source: Restore backup
es: Restaurar respaldo

# dataBackupExportExcelSoon
source: Excel export will be available soon.
es: Exportar a Excel estará disponible pronto.

# dataBackupExportEncryptedSoon
source: Encrypted backup will be available soon.
es: El respaldo encriptado estará disponible pronto.

# dataBackupRestoreSoon
source: Restore will be available soon.
es: La restauración estará disponible pronto.

# dataBackupExported
source: Excel file saved
es: Archivo Excel guardado

# dataBackupEncryptedExported
source: Encrypted backup saved
es: Respaldo encriptado guardado

# dataBackupRestoreSuccess
source: Backup restored successfully.
es: Respaldo restaurado con éxito.

# dataBackupRestoreError
source: Failed to restore backup.
es: No se pudo restaurar el respaldo.

# dataBackupPasswordTitle
source: Backup password
es: Contraseña de respaldo

# dataBackupPasswordLabel
source: Password
es: Contraseña

# dataBackupExporting
source: Exporting to Excel...
es: Exportando a Excel...

# dataBackupEncrypting
source: Generating encrypted backup...
es: Generando respaldo encriptado...

# dataBackupRestoring
source: Restoring backup...
es: Restaurando respaldo...

# dataBackupRestoreConfirmTitle
source: Restore backup
es: Restaurar respaldo

# dataBackupRestoreConfirmBody
source: This will replace all current data. Do you want to continue?
es: Esto reemplazará todos los datos actuales. ¿Deseas continuar?

source: Cancel
es: Cancelar

source: Confirm
es: Confirmar

# settingsSectionAbout
source: About
es: Acerca de

# settingsOriginTitle
source: Our story
es: Nuestra historia

# settingsOriginBody
source: This app started when I saw my friend and partner Michael “Micha” writing every sale in a notebook. I wanted to help him take control of his business with a simple, fast tool built for his day-to-day. Cosecha is that daily support to sell with clarity and decide with confidence.
es: Esta app nació al ver a mi amigo y socio Michael “Micha” anotar cada venta en una libreta. Quise ayudarlo a tener el control de su negocio con una herramienta simple, rápida y hecha a su medida. Cosecha es ese apoyo diario para vender con claridad y decidir con confianza.

# settingsDeveloperTitle
source: Developer
es: Desarrollador

# settingsDeveloperSubtitle
source: Built with privacy in mind
es: Creado con privacidad en mente

# developerTitle
source: Developer
es: Desarrollador

# developerBioTitle
source: About
es: Sobre mí

# developerBioBody
source: Software engineer and technical writer based in Panama.
es: Ingeniero de software y escritor técnico con sede en Panamá.

# developerFocusTitle
source: Focus
es: Enfoque

# developerFocusBody
source: Building apps, APIs, and product‑focused tools.
es: Desarrollo de apps, APIs y herramientas orientadas a producto.

# developerLeadershipTitle
source: Leadership
es: Liderazgo

# developerLeadershipBody
source: 10+ years building software and leading teams.
es: Más de 10 años creando software y liderando equipos.

# developerTechTitle
source: Technologies
es: Tecnologías

# developerTechBody
source: TypeScript, Node.js, React, Flutter, Python, PostgreSQL, and MongoDB.
es: TypeScript, Node.js, React, Flutter, Python, PostgreSQL y MongoDB.

# developerWebsite
source: Website
es: Sitio web

# settingsSupportTitle
source: Contact / Support
es: Contacto / Soporte

# settingsSupportSubtitle
source: Report bugs or suggest ideas
es: Reportar bugs o sugerir ideas

# supportEmail
source: support@cosecha.app
es: soporte@cosecha.app

# supportSubject
source: Improvement suggestions
es: Sugerencias de mejora

# supportBody
source: Hi team, I have a suggestion to improve the app:
es: Hola equipo, tengo una sugerencia para mejorar la app:

# settingsSectionDanger
source: Danger zone
es: Zona de peligro

# settingsResetTitle
source: Reset App
es: Restablecer App

# settingsResetSubtitle
source: Delete all data and restart
es: Borrar todos los datos y reiniciar

# settingsResetConfirmTitle
source: Reset app
es: Restablecer app

# settingsResetConfirmBody
source: This action will delete all your data. Do you want to continue?
es: Esta acción eliminará todos tus datos. ¿Deseas continuar?

# reportsTitle
source: Reports
es: Reportes

# reportsCustomizeTitle
source: Customize widgets
es: Personalizar widgets

# reportsCustomizePresetsTitle
source: Presets
es: Plantillas

# reportsPresetBasic
source: Basic
es: Basico

# reportsPresetCommercial
source: Commercial
es: Comercial

# reportsPresetAnalytical
source: Analytical
es: Analitico

# reportsWidgetExportTools
source: Export tools
es: Herramientas de exportacion

# reportsWidgetSummary
source: Summary
es: Resumen

# reportsWidgetPeriodComparison
source: Period comparison
es: Comparativo de periodo

# reportsWidgetTotalSalesTrend
source: Total sales trend
es: Tendencia de ventas

# reportsWidgetChannelMix
source: Channel mix
es: Mix por canal

# reportsWidgetMonthlySales
source: Monthly sales
es: Ventas mensuales

# reportsWidgetDailyHeatmap
source: Daily heatmap
es: Mapa de calor diario

# reportsWidgetTopProducts
source: Top products
es: Top productos

# reportsWidgetBottomProducts
source: Bottom products
es: Productos con menor venta

# reportsPeriodComparisonTitle
source: Period comparison
es: Comparativo de periodo

# reportsPeriodComparisonSubtitle
source: Current range vs previous range
es: Rango actual vs rango anterior

# reportsChannelMixTitle
source: Sales by channel
es: Ventas por canal

# reportsChannelMixSubtitle
source: Channel share in selected range
es: Participacion por canal en el rango seleccionado

# reportsChannelOther
source: Other
es: Otros

# reportsExportToolsTitle
source: Excel export
es: Exportacion Excel

# reportsExportToolsSubtitle
source: Configure fields and export current data
es: Configura campos y exporta los datos actuales

# reportsFilterAmountRange
source: Amount range
es: Rango de monto

# reportsFilterMinAmount
source: Min amount
es: Monto minimo

# reportsFilterMaxAmount
source: Max amount
es: Monto maximo

# reportsFilterMinQuantity
source: Min quantity
es: Cantidad minima

# reportsTopProducts
source: Top products
es: Top productos

# reportsBottomProducts
source: Bottom products
es: Productos con menor venta

# reportsTopEmpty
source: No sales in this range.
es: No hay ventas en este rango.

# reportsTotalSales
source: Total sales
es: Total ventas

# reportsMonthlySalesLast6
source: Monthly sales (last 6 months)
es: Ventas mensuales (últimos 6 meses)

# reportsDailyHeatmap
source: Daily activity heatmap
es: Mapa de calor diario

# reportsTransactions
source: Transactions
es: Transacciones

# reportsAvgTicket
source: Avg. ticket
es: Ticket promedio

# reportsUnits
source: units
es: unidades

# excelExportConfigTitle
source: Excel export settings
es: Configuracion de exportacion Excel

# excelExportModelProducts
source: Products
es: Productos

# excelExportModelSales
source: Sales
es: Ventas

# excelExportModelPriceHistory
source: Price history
es: Historial de precios

# excelExportFieldName
source: Name
es: Nombre

# excelExportFieldImageUrl
source: Image URL
es: URL de imagen

# excelExportFieldCurrentPrice
source: Current price
es: Precio actual

# excelExportFieldProductId
source: Product ID
es: ID producto

# excelExportFieldProductName
source: Product name
es: Nombre producto

# excelExportFieldAmount
source: Amount
es: Monto

# excelExportFieldQuantity
source: Quantity
es: Cantidad

# excelExportFieldChannel
source: Channel
es: Canal

# excelExportFieldCreatedAt
source: Created at
es: Fecha creacion

# excelExportFieldPrice
source: Price
es: Precio

# excelExportFieldRecordedAt
source: Recorded at
es: Fecha registro
